driver-tests/bpelse/correlation/FlowAsStartActivityJBI/test/Feature-CorrDefSepMsg/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:corr="http://xml.netbeans.org/schema/Corr-Flow-inlineSchema">
  <soapenv:Body>
    <corr:elem>
      <corrVal2>?string?</corrVal2>
      <content2>
        <id>3</id>
        <data>?string?</data>
      </content2>
    </corr:elem>
  </soapenv:Body>
</soapenv:Envelope>