driver-tests/bpelse/correlation/FlowAsStartActivityJBI/test/Feature-CorrDefSepMsg/Output.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
    <someNS:elem xmlns:someNS="http://xml.netbeans.org/schema/Corr-Flow-inlineSchema">
      <corrVal2 xmlns:msgns="http://j2ee.netbeans.org/wsdl/Corr-FlowAsStartActivity" xmlns="">?string?</corrVal2>
      <content2 xmlns="">
        <id xmlns:msgns="http://j2ee.netbeans.org/wsdl/Corr-FlowAsStartActivity">3</id>
        <data xmlns:msgns="http://j2ee.netbeans.org/wsdl/Corr-FlowAsStartActivity">?string??string?</data>
      </content2>
    </someNS:elem>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
