driver-tests/bpelse/dynamicpartnerlink/correlation/FlowAsStartActivityJBI/test/results/Feature-CorrDefSepMsg/Actual_20130314135642_S.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" 
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
    xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
    <elem xmlns="http://xml.netbeans.org/schema/Corr-Flow-inlineSchema" xmlns:msgns="http://j2ee.netbeans.org/wsdl/driverWSDL">
      <corrVal2 xmlns="">?string?</corrVal2>
      <content2 xmlns="">
        <id>3</id>
        <data>?string??string?</data>
      </content2>
    </elem>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>